zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_usb.h
/* USB_TXIE Bits */
/* USB_TXIE[EP0] Bits */
#define USB_TXIE_EP0_OFS                         (0)                             /* !< EP0 Offset */
#define USB_TXIE_EP0_MASK                        ((uint16_t)0x00000001U)         /* !< Transmit Endpoint 0 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP0_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP0 transmit and receive
                                                                                    interrupt is suppressed and not sent
                                                                                    to the interupt controller. */
#define USB_TXIE_EP0_ENABLE                      ((uint16_t)0x00000001U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP0 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP1] Bits */
#define USB_TXIE_EP1_OFS                         (1)                             /* !< EP1 Offset */
#define USB_TXIE_EP1_MASK                        ((uint16_t)0x00000002U)         /* !< Transmit Endpoint 1 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP1_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP1 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP1_ENABLE                      ((uint16_t)0x00000002U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP1 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP2] Bits */
#define USB_TXIE_EP2_OFS                         (2)                             /* !< EP2 Offset */
#define USB_TXIE_EP2_MASK                        ((uint16_t)0x00000004U)         /* !< Transmit Endpoint 2 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP2_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP2 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP2_ENABLE                      ((uint16_t)0x00000004U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP2 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP3] Bits */
#define USB_TXIE_EP3_OFS                         (3)                             /* !< EP3 Offset */
#define USB_TXIE_EP3_MASK                        ((uint16_t)0x00000008U)         /* !< Transmit Endpoint 3 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP3_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP3 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP3_ENABLE                      ((uint16_t)0x00000008U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP3 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP4] Bits */
#define USB_TXIE_EP4_OFS                         (4)                             /* !< EP4 Offset */
#define USB_TXIE_EP4_MASK                        ((uint16_t)0x00000010U)         /* !< Transmit Endpoint 4 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP4_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP4 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP4_ENABLE                      ((uint16_t)0x00000010U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP4 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP5] Bits */
#define USB_TXIE_EP5_OFS                         (5)                             /* !< EP5 Offset */
#define USB_TXIE_EP5_MASK                        ((uint16_t)0x00000020U)         /* !< Transmit Endpoint 5 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP5_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP5 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP5_ENABLE                      ((uint16_t)0x00000020U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP5 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP6] Bits */
#define USB_TXIE_EP6_OFS                         (6)                             /* !< EP6 Offset */
#define USB_TXIE_EP6_MASK                        ((uint16_t)0x00000040U)         /* !< Transmit Endpoint 6 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP6_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP6 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP6_ENABLE                      ((uint16_t)0x00000040U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP6 bit
                                                                                    in the USBTXIS register is set. */
/* USB_TXIE[EP7] Bits */
#define USB_TXIE_EP7_OFS                         (7)                             /* !< EP7 Offset */
#define USB_TXIE_EP7_MASK                        ((uint16_t)0x00000080U)         /* !< Transmit Endpoint 7 Interrupt
                                                                                    Enable */
#define USB_TXIE_EP7_DISABLE                     ((uint16_t)0x00000000U)         /* !< The EP7 transmit interrupt is
                                                                                    suppressed and not sent to the
                                                                                    interrupt controller. */
#define USB_TXIE_EP7_ENABLE                      ((uint16_t)0x00000080U)         /* !< An interrupt is sent to the
                                                                                    interrupt controller when the EP7 bit
                                                                                    in the USBTXIS register is set. */

/* USB_RXIE Bits */
/* USB_RXIE[EP1] Bits */
#define USB_RXIE_EP1_OFS                         (1)                             /* !< EP1 Offset */
#define USB_RXIE_EP1_MASK                        ((uint16_t)0x00000002U)         /* !< Recieve Endpoint 1 Interrupt Enable */
#define USB_RXIE_EP1_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP1_INT                         ((uint16_t)0x00000002U)         /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP2] Bits */
#define USB_RXIE_EP2_OFS                         (2)                             /* !< EP2 Offset */
#define USB_RXIE_EP2_MASK                        ((uint16_t)0x00000004U)         /* !< Recieve Endpoint 2 Interrupt Enable */
#define USB_RXIE_EP2_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP2_INT                         ((uint16_t)0x00000004U)         /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP3] Bits */
#define USB_RXIE_EP3_OFS                         (3)                             /* !< EP3 Offset */
#define USB_RXIE_EP3_MASK                        ((uint16_t)0x00000008U)         /* !< Recieve Endpoint 3 Interrupt Enable */
#define USB_RXIE_EP3_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP3_INT                         ((uint16_t)0x00000008U)         /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP4] Bits */
#define USB_RXIE_EP4_OFS                         (4)                             /* !< EP4 Offset */
#define USB_RXIE_EP4_MASK                        ((uint16_t)0x00000010U)         /* !< Recieve Endpoint 4 Interrupt Enable */
#define USB_RXIE_EP4_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP4_INT                         ((uint16_t)0x00000010U)         /* !< The Endpoint 4 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP5] Bits */
#define USB_RXIE_EP5_OFS                         (5)                             /* !< EP5 Offset */
#define USB_RXIE_EP5_MASK                        ((uint16_t)0x00000020U)         /* !< Recieve Endpoint 5 Interrupt Enable */
#define USB_RXIE_EP5_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP5_INT                         ((uint16_t)0x00000020U)         /* !< The Endpoint 5 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP6] Bits */
#define USB_RXIE_EP6_OFS                         (6)                             /* !< EP6 Offset */
#define USB_RXIE_EP6_MASK                        ((uint16_t)0x00000040U)         /* !< Recieve Endpoint 6 Interrupt Enable */
#define USB_RXIE_EP6_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP6_INT                         ((uint16_t)0x00000040U)         /* !< The Endpoint 6 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIE[EP7] Bits */
#define USB_RXIE_EP7_OFS                         (7)                             /* !< EP7 Offset */
#define USB_RXIE_EP7_MASK                        ((uint16_t)0x00000080U)         /* !< Recieve Endpoint 7 Interrupt Enable */
#define USB_RXIE_EP7_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIE_EP7_INT                         ((uint16_t)0x00000080U)         /* !< The Endpoint 7 transmit interrupt
                                                                                    is asserted. */

/* USB_USBIS Bits */
/* USB_USBIS[SUSPEND] Bits */
#define USB_USBIS_SUSPEND_OFS                    (0)                             /* !< SUSPEND Offset */
#define USB_USBIS_SUSPEND_MASK                   ((uint8_t)0x00000001U)          /* !< Set when Suspend signaling is
                                                                                    detected on the bus. Note: Only valid
                                                                                    in Peripheral mode. */
#define USB_USBIS_SUSPEND_NO_INT                 ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_SUSPEND_INT                    ((uint8_t)0x00000001U)          /* !< SUSPEND signaling has been detected
                                                                                    on the bus. */
/* USB_USBIS[RESUME] Bits */
#define USB_USBIS_RESUME_OFS                     (1)                             /* !< RESUME Offset */
#define USB_USBIS_RESUME_MASK                    ((uint8_t)0x00000002U)          /* !< Set when Resume signaling is
                                                                                    detected on the bus while the USB
                                                                                    controller is in Suspend mode. */
#define USB_USBIS_RESUME_NO_INT                  ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_RESUME_INT                     ((uint8_t)0x00000002U)          /* !< RESUME signaling has been detected
                                                                                    on the bus. */
/* USB_USBIS[RESETBABBLE] Bits */
#define USB_USBIS_RESETBABBLE_OFS                (2)                             /* !< RESETBABBLE Offset */
#define USB_USBIS_RESETBABBLE_MASK               ((uint8_t)0x00000004U)          /* !< Device mode - RESET: Set in
                                                                                    Peripheral mode when Reset signaling
                                                                                    is detected on the bus. Host mode -
                                                                                    BABBLE: Set in Host mode when babble
                                                                                    is detected. Note: Only active after
                                                                                    first SOF has been sent. */
#define USB_USBIS_RESETBABBLE_NO_INT             ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_RESETBABBLE_INT                ((uint8_t)0x00000004U)          /* !< RESET / BABBLE signaling has been
                                                                                    detected on the bus. */
/* USB_USBIS[SOF] Bits */
#define USB_USBIS_SOF_OFS                        (3)                             /* !< SOF Offset */
#define USB_USBIS_SOF_MASK                       ((uint8_t)0x00000008U)          /* !< Start of frame */
#define USB_USBIS_SOF_NO_INT                     ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_SOF_INT                        ((uint8_t)0x00000008U)          /* !< A new frame has started. */
/* USB_USBIS[CONN] Bits */
#define USB_USBIS_CONN_OFS                       (4)                             /* !< CONN Offset */
#define USB_USBIS_CONN_MASK                      ((uint8_t)0x00000010U)          /* !< Set when a device connection is
                                                                                    detected.  Note: Only valid in Host
                                                                                    mode. Valid at all transaction
                                                                                    speeds. */
#define USB_USBIS_CONN_NO_INT                    ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_CONN_INT                       ((uint8_t)0x00000010U)          /* !< The device has detected a
                                                                                    connection to the host. */
/* USB_USBIS[DISCON] Bits */
#define USB_USBIS_DISCON_OFS                     (5)                             /* !< DISCON Offset */
#define USB_USBIS_DISCON_MASK                    ((uint8_t)0x00000020U)          /* !< Set in Host mode when a device
                                                                                    disconnect is detected. Set in
                                                                                    Peripheral mode when a session ends.
                                                                                    Valid at all transaction speeds. */
#define USB_USBIS_DISCON_NO_INT                  ((uint8_t)0x00000000U)          /* !< No interrupt */
#define USB_USBIS_DISCON_INT                     ((uint8_t)0x00000020U)          /* !< The device has been disconnected
                                                                                    from the host. */

